/*
为了将地图模型化，墙用#表示；敌人用G表示；空地用.表示。当然炸弹只能放到空地上；
我们的思想是用一个二维数组去存储这个地图，至于炸弹放置自哪一个点可以消灭的敌人最多我们
需要一个个的去尝试。
*/
#include<stdio.h>

int main()
{
    char a[20][21];//假设这里的地图大小不超过20*20;
    int i,j,sum,map=0,p,q,x,y,n,m;
    //读入n和m表示每行有多少列
    scanf("%d %d",&n,&m);

    //读入n行字符，建地图ing
    for(i=0;i<=n-1;i++)
    {
        scanf("%s",a[i]);//这里需要对二维数组有了解才行，每次规定了第几行，这里输入的是一整行的值，长度是不大于m（列）个
    }

    //用两重循环枚举地图中的每一点；
    for(i=0;i<=n-1;i++)
    {
        for(j=0;j<=m-1;j++)
        {
            //首先判断这个点是不是平地，是平地才可以被放置炸弹；
            if(a[i][j]=='.')
            {
                sum = 0;//sum用来计数（可以消灭的敌人数量）所以初始化要置零；
                //将当前的坐标i，j赋值到两个新的变量x，y中，以便向上下左右四个方向分别统计可以消灭的敌人数；


                //向上统计可以消灭的敌人数；
                x = i; y = j;
                while(a[x][y] != '#')//判断是不是墙，如果不是墙就继续
                {
                    //如果当前是敌人。则继续计数；
                    if(a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //x--的作用是继续向上统计；
                    x--;
                }
                //向下统计可以消灭的敌人数
                x = i; y = j;
                while(a[x][y] != '#')
                {
                    if(a[x][y] == 'G')
                    {
                        sum++;
                    }
                    x++;
                }
                //向右统计可以消灭的敌人数
                x = i; y = j;
                while(a[x][y] != '#')
                {
                    if(a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向右移动
                    y++;
                }
                //向左统计可以消灭的敌人数
                x = i; y = j;
                while(a[x][y] != '#')
                {
                    if(a[x][y] == 'G')
                    {
                        sum++;
                    }
                    //继续向左移动；
                    y--;
                }
            if(sum>map)
                {
                    //如果当前点能消灭的敌人总数大于map，则更新map
                    map = sum;
                    //并用p、q记录当前的坐标；
                    p = i;
                    q = j;
                }
            }
        
            
        }
    }
    printf("put the bomb at(%d,%d).most kill %d enemies.\n",p,q,map);
    return 0;




}

/*
#############
#GG.GGG#GGG.#
###.#G#G#G#G#
#.......#..G#
#G#.###.#G#G#
#GG.GGG.#.GG#
#G#.#G#.#.###
##G...G.....#
#G#.#G###.#G#
#...G#GGG.GG#
#G#.#G#G#.#G#
#GG.GGG#G.GG#
#############


*/